; domain
(define (domain snake)
(:requirements :equality :negative-preconditions)
(:constants
    dummypoint
)
(:predicates
    ;up down left right of a field
    (ISADJACENT ?x ?y)
    ;the last field of the snake
    (tailsnake ?x)
    ;the first field of the snake
    (headsnake ?x)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y)
    ;a field that is occupied by the snake or by an obstacle
    (blocked ?x)
    ;next point that will spawn
    (spawn ?x)
    ;point y will spawn after point x
    (NEXTSPAWN ?x ?y)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x)
)
(:action move
    :parameters (?head ?newhead ?tail ?newtail)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)

(:action move-and-eat-spawn
    :parameters (?head ?newhead ?spawnpoint ?nextspawnpoint)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn ?spawnpoint)
        (NEXTSPAWN ?spawnpoint ?nextspawnpoint)
        (not (= ?spawnpoint dummypoint))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (ispoint ?spawnpoint)
        (not (spawn ?spawnpoint))
        (spawn ?nextspawnpoint)
    )
)

(:action move-and-eat-no-spawn
    :parameters (?head ?newhead)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn dummypoint)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)

)

; problem
(define (problem snake-empty-3x4-1-1-1-94)
(:domain snake)
(:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos1-0 pos1-1 pos1-2 pos1-3 pos2-0 pos2-1 pos2-2 pos2-3
)
(:init
    (isAdjacent pos0-0 pos1-0)
 (isAdjacent pos0-0 pos0-1)
 (isAdjacent pos0-1 pos1-1)
 (isAdjacent pos0-1 pos0-2)
 (isAdjacent pos0-1 pos0-0)
 (isAdjacent pos0-2 pos1-2)
 (isAdjacent pos0-2 pos0-3)
 (isAdjacent pos0-2 pos0-1)
 (isAdjacent pos0-3 pos1-3)
 (isAdjacent pos0-3 pos0-2)
 (isAdjacent pos1-0 pos2-0)
 (isAdjacent pos1-0 pos1-1)
 (isAdjacent pos1-0 pos0-0)
 (isAdjacent pos1-1 pos2-1)
 (isAdjacent pos1-1 pos1-2)
 (isAdjacent pos1-1 pos0-1)
 (isAdjacent pos1-1 pos1-0)
 (isAdjacent pos1-2 pos2-2)
 (isAdjacent pos1-2 pos1-3)
 (isAdjacent pos1-2 pos0-2)
 (isAdjacent pos1-2 pos1-1)
 (isAdjacent pos1-3 pos2-3)
 (isAdjacent pos1-3 pos0-3)
 (isAdjacent pos1-3 pos1-2)
 (isAdjacent pos2-0 pos2-1)
 (isAdjacent pos2-0 pos1-0)
 (isAdjacent pos2-1 pos2-2)
 (isAdjacent pos2-1 pos1-1)
 (isAdjacent pos2-1 pos2-0)
 (isAdjacent pos2-2 pos2-3)
 (isAdjacent pos2-2 pos1-2)
 (isAdjacent pos2-2 pos2-1)
 (isAdjacent pos2-3 pos1-3)
 (isAdjacent pos2-3 pos2-2)
    (tailSnake pos0-1)
    (headSnake pos1-1)
    (nextSnake pos1-1 pos0-1)
    (blocked pos0-1)
 (blocked pos1-1)
    (spawn pos1-2)
 (nextSpawn pos1-2 dummyPoint)
    (isPoint pos1-3)
)
(:goal (and
    (not (isPoint pos1-3))
 (not (isPoint pos1-2))
))
)

; plan
1. (move pos1-1 pos1-2 pos0-1 pos1-1)
   deleted: (headsnake pos1-1) (blocked pos0-1) (tailsnake pos0-1) (nextsnake pos1-1 pos0-1)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-1) (tailsnake pos1-1)
   goals met: 1 of 2
2. (move-and-eat-spawn pos1-2 pos1-3 pos1-2 dummypoint)
   deleted: (headsnake pos1-2) (ispoint pos1-3) (spawn pos1-2)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos1-2) (ispoint pos1-2) (spawn dummypoint)
   goals met: 1 of 2
3. (move pos1-3 pos0-3 pos1-1 pos1-2)
   deleted: (headsnake pos1-3) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos1-2 pos1-1)
   added: (blocked pos0-3) (headsnake pos0-3) (nextsnake pos0-3 pos1-3) (tailsnake pos1-2)
   goals met: 1 of 2
4. (move pos0-3 pos0-2 pos1-2 pos1-3)
   deleted: (headsnake pos0-3) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos1-3 pos1-2)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos0-3) (tailsnake pos1-3)
   goals met: 1 of 2
5. (move-and-eat-no-spawn pos0-2 pos1-2)
   deleted: (headsnake pos0-2) (ispoint pos1-2)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos0-2)
   goals met: 2 of 2
